<template>
	<u-swiper :list="list" :title="true" @click="clickSwiper"></u-swiper>
</template>

<script>
	export default {
			data() {
				return {
					list: [{
							image: '/static/common/img/qcb-1.jpg',
							title: '酱香千层饼',
							quote:"北方人也都会做面食，尤其是年纪稍大一点的这一代，只要工作不忙，在家鼓捣些家常面食完全没有问题，咱们今天烙酱香千层饼，非常好吃，做法也很简单，一起来看看吧。",
							mainMaterial:"面粉、水",
							content:[
								"先把面团材料放在盆中，揉成面团，盖上保鲜膜饧一个小时。饧过的面团比较软，移放在揉面垫上，别再揉搓，直接按扁。",
								"擀成大面片，擀开时如果觉得擀不动，不用急着擀，边饧边擀就比较容易擀开了。",
								"把油酥材料除油之外的材料放耐热碗中，油在炒锅中烧热，趁热浇在碗中，拌均匀后油酥就做好了。",
								"把油酥抹均匀抹在擀好的面片上面，抹好后卷起来，之后均分成三份，每份都用手整圆后再按扁，擀成薄饼",
								"电火锅通电中火预热，在锅底刷一些油，之后放上擀好的饼子，保持中火煎烙，期间盖上锅盖，饼子熟得比较快而且口感会相对软一些。",
								"然后把饼子翻面，在饼子表面刷一层酱，放上芝麻和切碎和芹菜，再次盖上锅盖，饼子底部煎黄后就可以出锅了。",
								"三张饼子依次煎好，出锅切成小块就可以上桌了，香喷喷的可好吃了。"
							]
							
						},
						{
							image: '/static/common/img/xlx-1.jpg',
							title: '麻辣小龙虾',
							quote:"如今夏季吃小龙虾已经风靡全国，当然做法各有不同,口味也就不一样啦!不管哪种做法,爱吃龙虾的人肯定都不愿意错过的!每天晚上坐在大排﻿档品着小龙虾,喝着冰镇的啤酒成为一道亮丽的风景线呢!",
							mainMaterial:"小龙虾",
							content:[
								"小龙虾漂水几天，用牙刷刷干净；去头去虾肠，洗干净备用。",
								"青蒜和香葱洗干净切段备用；姜和蒜切片，葱头切丝备用，花椒一小把，干辣椒切段备用，甜酱1勺。",
								"锅热注油，倒入部分青蒜，香葱，葱头，姜和蒜片一起爆香，再倒入干辣椒，花椒和八角一起翻炒。",
								"干辣椒约变色时，放入小龙虾大火爆炒，至虾壳变红时，倒入一勺甜酱继续翻炒上色。",
								"依次放入少许白酒炒匀，再放入1勺半的盐一起翻炒，放入一碗水约和龙虾齐平，大火烧开，转小火烧约三分之一汤汁，再放入剩下的青蒜，香葱和蒜片等炒匀",
								"最后大火收汁，盛起装盘即可。",
							]
						},
					],
				}
			},
			methods: {
				clickSwiper(e){
					console.log('e',e)
					let info = this.list[e];
					uni.setStorageSync('recommendDetail', info);
					this.$u.route({
									url: 'pages/neo/recommend/index',
								})
				}
	
			}
		}
</script>

<style>
</style>
